# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
# и проверяет, является ли этот день выходным.
#Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

# day = int(input('Введите число от 1 до 7: '))
# if day > 7 or day < 1:
#     print('Число не входит в заданный диапазон')
# elif day == 6 or day == 7:
#     print("Да")
# else:
#     print("Нет")




# Напишите программу для. проверки истинности утверждения 
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.




# Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
# в которой находится эта точка (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

# x = int(input('Введите x: '))
# y = int(input('Введите y: '))
# if x > 0 and y > 0:
#     print('1')
# if x < 0 and y > 0:
#     print('2')
# if x < 0 and y < 0:
#     print('3')
# if x > 0 and y < 0:
#     print('4')




# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

# a = int(input('Введите номер четверти: '))
# if a == 1:
#    print('x > 0 and y > 0')
# if a == 2:
#    print('x < 0 and y > 0')
# if a == 3:
#    print('x < 0 and y < 0')
# if a == 4:
#    print('x > 0 and y < 0')




# Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

# print('Введите координаты точки А:')
# ax = float(input('X: '))
# ay = float(input('Y: '))
# print('Введите координаты точки B:')
# bx = float(input('X: '))
# by = float(input('Y: '))
# ac = ay - by
# bc = bx - ax
# print(round((ac ** 2 + bc **2) ** 0.5, 2))
